---
title: Unnature Amino Acids
categories: 
- biology
tags: 
- biology
---

## 化学方法
### 蛋白质的化学修饰
特殊的反应试剂，能够选择性地与蛋白质中特定的氨基酸侧链发生反应. 但是，由于这种途径依赖于蛋白质侧链的唯一反应性，使得它的固有选择性和总效率受到了很大的限制.

### 化学合成 chemoselective reactions
低溶解性、低收率以及期望合成高分子量蛋白质所需要的高费

### 半合成
通过化学裂解、蛋白质水解或者重组方法得到的短天然蛋白质与化学合成肽之间进行连接. 利用SPPS手段合成出含有非天然氨基酸的部分，而目标蛋白质的另外一部分则是通过重组方法得到，然后利用化学交联的手段将两部分连接起来，从而获得一条带有非天然氨基酸的全长半合成蛋白。

## 体外生物合成
1. 氨基酰化反应产物收率很低，氨基酸的N-端保护基团也很难被除掉，而且会进一步限制下一个氨基酸的引入
2. 这种方法利用三个终止密码子UAA，UAG，UGA。这些密码子并不编码任何氨基酸，而是通过和释放因子结合，作为蛋白合成的终止信号。而蛋白的终止只需要一个终止密码子就可以完成，那么另外两个“闲置”的终止密码子就能够被用来引入到mRNA 中，从而在翻译过程中引入非天然氨基酸
3. 使用这些带有非天然氨基酸的氨酰化的ｔＲＮＡｓ合成蛋白质，但含有非天然氨基酸的氨酰化ｔＲＮＡ加合物稳定性很差

## 体内生物合成
### 营养缺陷型菌株用于引入非天然氨基酸
这种菌株有一个特点，就是自身缺乏合成某种天然氨基酸的能力。在诱导某种蛋白质表达过程中，如果培养基中缺少细菌自身不能合成的氨基酸，而添加这种氨基酸的类似物，那么就会在目的蛋白中插入这种氨基酸的类似物.

### 基因密码的扩展
若想位点特异性地引入非天然氨基酸，必须具备几个条件: 
1. 一是密码子的特异性，即保证tRNA 只与一种专有密码子识别
2. 二是氨酰-tRNA合成酶(RS)与相应的tRNA的特异性，即保证氨酰-tRNA合成酶(RS)只能识别相应的tRNA，而不能结合宿主体内任何其他的tRNA，而这种tRNA也不能被宿主体内任何的氨酰-tRNA 合成酶( RS) 所识别; 
3. 三是tRNA与非天然氨基酸的氨酰化作用的专一性，即保
证非天然氨基酸只与所对应的tRNA结合，而不结合宿主体内的任何其他tRNA，同样这个tRNA也不能结合任何其他氨基酸。

UAG 是三种终止密码子中使用率最低的.

Schultz 等首先选用大肠杆菌体内的tRNA /RS对，将tRNA /RS 界面上的某些核苷酸突变，既能保证RS对tRNA识别的宽松，又能保证tRNA /RS 与其他tRNA/RS的正交性。根据tRNA/RS晶体结构，一个tRNAGln/GlnRS的突变体被选择出来。不幸的是，即使突变最完美的tRNAGln/GlnRS也不能同细菌体内其他的tRNA /RS 完全正交。随后，他们又将外源的tRNA/RS对引入到大肠杆菌中，发现一种古生菌属的甲烷球菌MjtRNATyr/TyrRS同大肠杆菌自身tRNA /RS 正交。，即MyTyrRS不识别大肠杆菌的tRNAs，大肠杆菌的aaRSs也不识别MjRNAtyr但是，这个MjtRNATyr仍然被细菌自身的RS 低水平地氨酰化。为了弥补这个缺点，Schultz等将MjtRNATyr 随机突变，做成一个基因文库，通过对文库阳性和阴性筛选的方式得到了既能同MjTyrRS特异性结合，又与细菌自身RS正交的tRNAs

Schultz 等同样利用随机突变的方式构建RS 的基因文库，再
利用阳性和阴性选择的方式进行筛选，得到一种只能氨酰化非天然氨基酸的RS

在蛋白质翻译中，UAG终止密码子指导蛋白质合成的终止，但大肠杆菌和酿酒酵母很少用其做终止密码子．基于这一现象，将校正tRNA的反义密码子突变为CUA，再利用校正tRNA/aaRS对通读UAG密码子，完成UAA对蛋白质的修饰


## 生物正交反应
基于生物正交反应的标记(即生物正交标记), 需要
在目标蛋白中引入特定的生物正交基团, 然后通过生物
正交反应与含有互补基团的探针进行反应, 从而实现对
目标蛋白的特异标记.

生物正交反应包含两个组分,即生物正交反应对(Bioorthogonal Reaction Pair).

#### 生物正交基团向目标蛋白质的引入

## 功能化及应用
### 点击化学
### 炔和叠氮功能化
### 酮和醛的功能化
### 烯烃功能化

## Reference 
1. doi:10.3969/j.issn.1674-232X.2013.05.011
2. New Strategies for Protein Functionalization:
Inserting Unnatural Amino Acids into Proteins
3. DOI: 10.6023/A12050263
